SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( #MT_DB_BRBlueGrey_Class254006
 
 
 
 
 
 
 Type ( Engine )
 WagonShape ( MT_Class43_PowerCar.s )
 FreightAnim ( 254006.s 0 5.0 11 )

 
 
 Size ( 2.88m 4.27m 17.3m ) 
 
 Mass ( 70t )
 WheelRadius ( 40in/2 )
 InertiaTensor ( Box ( 2.88m 4.27m 17.3m ) )
 Coupling (
 Type ( Automatic )
 Spring (
 Stiffness ( 2e7N/m 0 )
 Damping ( 0.2e7N/m/s 0 )
 Break ( 1e7N 0 )
 r0 ( 10cm 1e9 )
 )
 CouplingHasRigidConnection ( 1 )
 Velocity ( 0.1m/s )
 )

 Buffers (
 Spring (
 Stiffness ( 1e7N/m 0 )
 Damping ( 1e6N/m/s 0 )
 r0 ( 0m 1e9 )
 )
 Centre ( 0.5 )
 Radius ( 1 )
 Angle ( 0.5deg )
 )

 Adheasion ( 1 1 0.22 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 2.5*70t )
 DerailBufferForce ( 500kN )
 NumWheels ( 1 )
 Friction (
 100N/m/s 0 -1mph 0 1
 5.1N/rad/s 1 -1rad/s 0 1
 )

 Antislip ( 1 )


 BrakeEquipmentType ( "Triple_valve, Auxilary_reservoir, Emergency_brake_reservoir" )

 BrakeSystemType ( "Air_single_pipe" )
 MaxBrakeForce( 68.7kN )

 EmergencyBrakeResMaxPressure( 110 )
 TripleValveRatio( 2.5 )
 MaxReleaseRate( 20 )
 MaxApplicationRate( 20 )
 MaxAuxilaryChargingRate( 30 )
 EmergencyResCapacity( 10 )
 EmergencyResChargingRate( 30 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 56 )

 IntakePoint ( 3.33 0.4 FuelDiesel )

Lights ( 10
 comment (Original Light settings)
 
 Light (
 
 Type ( 1 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( ffffcb8d )
 Position ( 0 2.34 8.66 )
 Transition ( 0 )
 Radius ( 150 )
 Angle ( 10.0 )
 )
 )
 )
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 2 )
 Control (2)
 )
 Cycle ( 0 )
 FadeIn ( 0.1 )
 FadeOut ( 0.1 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( ffffcb8d )
 Position ( .98 1.62 8.42 )
 Elevation ( -47.697 -47.697 -47.697 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )
Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.1 )
 FadeOut ( 0.1 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( ffffcb8d )
 Position ( -1.00 1.62 8.42 )
 Elevation ( -43.3068 -43.3068 -43.3068 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Control ( 1 )
 Unit ( 2 )
 )
 FadeIn ( 0.25 )
 FadeOut ( 0.25 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( ffffcb8d )
 Position ( 0.60 1.62 8.52 )
 Azimuth ( 0 0 0 )
 Elevation ( -43 -43 -43)
 Transition ( 0 )
 Radius ( 0.50 )
 )
 )
 )
 

 
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 4 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( ffffcb8d )
 Position ( 0.60 1.62 8.52 )
 Azimuth ( 0 0 0 )
 Elevation ( -43 -43 -43)
 Transition ( 0 )
 Radius ( 0.50 )
 )
 )
 )
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 4 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( ffffcb8d )
 Position ( -0.60 1.62 8.52 )
 Azimuth ( 0 0 0 )
 Elevation ( -43 -43 -43 )
 Transition ( 0 )
 Radius ( 0.50 )
 )
 )
 )

Light (

 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 4 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( ffff0000 )
 Position ( -1.00 1.62 8.42 )
 Elevation ( -43.3068 -43.3068 -43.3068 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
)

Light (

 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 4 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( ffff0000 )
 Position ( .98 1.62 8.42 )
 Elevation ( -47.697 -47.697 -47.697 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
)
Light (
 
 Type ( 0 )
 Conditions (
 Unit ( 3 )
 Service ( 0 )
 Control ( 0 )
 )
 FadeIn ( 0.0 )
 FadeOut ( 0.0 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( ffff0000 )
 Position ( -1.00 1.62 8.42 )
 Elevation ( -43.3068 -43.3068 -43.3068 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )
 
Light (
 
 Type ( 0 )
 Conditions (
 Unit ( 3 )
 Service ( 0 )
 )
 FadeIn ( 0.0 )
 FadeOut ( 0.0 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( ffff0000 )
 Position ( .98 1.62 8.42 )
 Elevation ( -47.697 -47.697 -47.697 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )
 
)

 Sound ( "..\\..\\MT_Common.Sound\\MT_GC_HST\\MT_GC_43_LEAD.sms" )

)

Engine ( #MT_DB_BRBlueGrey_Class254006

 Effects
 (
 DieselSpecialEffects
 (
 comment
 (
 the format of these little blocks is as follow:

 offset.x offset.y offset.z
 normal.x normal.y normal.z
 width in metres

 defining the offset from the shape pivot point
 where steam / smoke should appear, the direction
 it should go and the width of the nozzle
 )
 Exhaust1
 ( -0.3 4.03914 2.9
 -.2 0.75 0
 0.2
 )

 Exhaust2
 ( 0.3 4.03914 2.9
 .2 0.75 0
 0.2
 )
 )
 )


 Wagon ( #MT_DB_BRBlueGrey_Class254006 )
 Type ( Diesel )
 MaxPower ( 1770kW )
 MaxForce ( 80kN )
 MaxContinuousForce ( 46kN )
 RunUpTimeToMaxForce ( 6.0 )
 
 MaxDieselLevel( 1000gal ) 
 MaxVelocity ( 147mph )
 MaxCurrent ( 7500A #2500A x 3 **DO NOT EXCEED 2500A WHEN DRIVING**)
 
 
 WheelRadius ( 40in/2 )
 NumWheels ( 1 )
 MaxTemperature ( 120 )
 MaxOilPressure ( 90 )

 AirBrakesAirCompressorPowerRating( 3.5 )
 AirBrakesMainMinResAirPressure( 0 )
 AirBrakesMainMaxAirPressure( 140 )
 AirBrakesMainResVolume( 10 )
 AirBrakesAirCompressorWattage( 19000 )
 AirBrakesCompressorRestartPressure( 130 )
 AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.5 )
 AirBrakesHasLowPressureTest( 1 )
 AirBrakesIsCompressorElectricOrMechanical( 1 )

 EngineBrakesControllerMinPressureReduction( 6 )
 TrainBrakesControllerMinPressureReduction( 10 )
 EngineBrakesControllerHasProportionalBrake( 1 )
 EngineBrakesProportionalBrakeLag( 0.9 )
 EngineBrakesControllerMaxApplicationRate( 20 )
 TrainBrakesControllerMaxApplicationRate( 10 )
 EngineBrakesControllerMaxReleaseRate( 20 )
 TrainBrakesControllerMaxReleaseRate( 4 )
 EngineBrakesControllerEmergencyApplicationRate( 50 )
 TrainBrakesControllerEmergencyApplicationRate( 50 )
 EngineBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMinSystemPressure( 0 )
 EngineBrakesControllerMaxSystemPressure( 90 )
 TrainBrakesControllerMaxSystemPressure( 90 )
 EngineBrakesControllerEmergencyBrakeTimePenalty( 0 )
 TrainBrakesControllerEmergencyBrakeTimePenalty( 0 )
 EngineBrakesControllerFullServicePressureDrop( 26 )
 TrainBrakesControllerFullServicePressureDrop( 26 )

 DynamicBrakesMinUsableSpeed( 5 )
 DynamicBrakesMaximumEffectiveSpeed( 65 )
 DynamicBrakesMaximumForce( 430kN )
 DynamicBrakesResistorCurrentLimit ( 850 )
 DynamicBrakesCutInSpeed( 8 )
 DynamicBrakesMaxAirBrakePressure ( 15 )
 DynamicBrakesFadingSpeed( 25 )
 DynamicBrakesDelayTimeBeforeEngaging ( 10 )
 DynamicBrakesMaximumSpeedForFadeOut ( 65 )
 DynamicBrakesEffectAtMaximumFadeOut( 0 )
 DynamicBrakesHigherSpeedCurveExponent( 1 )
 DynamicBrakesLowerSpeedCurveExponent( 1 )
 DynamicBrakesNumberOfControllerNotches( 8 )
 DynamicBrakeHasAutoBailOff( 1 )

 BrakesEngineBrakeType ( "Air_single_pipe" )
 BrakesTrainBrakeType ( "Air_single_pipe" )
 BrakesEngineControllers( "Independent, Train" )

 EngineBrakesControllerDirectControlExponent( 1 )
 
 


 MaxDieselLevel ( 1000gal )
 DieselUsedPerHourAtMaxPower ( 60gal )
 DieselUsedPerHourAtIdle ( 10gal )

 (* Excessive smoke in ORTS so reduced values to 1/4.
 DieselSmokeEffectInitialMagnitude( 2.2 )
 DieselSmokeEffectMaxMagnitude( 2.2 )
 DieselSmokeEffectInitialSmokeRate( 0.4 )
 DieselSmokeEffectMaxSmokeRate( 10 )
 *)
 DieselSmokeEffectInitialMagnitude( 0.55 )
 DieselSmokeEffectMaxMagnitude( 0.55 )
 DieselSmokeEffectInitialSmokeRate( 0.1 )
 DieselSmokeEffectMaxSmokeRate( 2.5 )
 
 DieselEngineIdleRPM( 115 )
 DieselEngineMaxRPM( 900 )
 DieselEngineSpeedOfMaxTractiveEffort( 13mph )
 DieselEngineMaxRPMChangeRate( 40 )

 DoesHornTriggerBell( 0 )
 
 
 MaxSandingTime( -1 )

 EmergencyStopMonitor(
 MonitoringDeviceMonitorTimeLimit( 0 )
 MonitoringDeviceAlarmTimeLimit( 0 )
 MonitoringDevicePenaltyTimeLimit( 0 )
 MonitoringDeviceCriticalLevel( 0 )
 MonitoringDeviceResetLevel( 0 )
 MonitoringDeviceAppliesFullBrake( 0 )
 MonitoringDeviceAppliesEmergencyBrake( 1 )
 MonitoringDeviceAppliesCutsPower( 1 )
 MonitoringDeviceAppliesShutsDownEngine( 0 )
 )

 VigilanceMonitor(
 MonitoringDeviceMonitorTimeLimit( 25 )
 MonitoringDeviceAlarmTimeLimit( 17 )
 MonitoringDevicePenaltyTimeLimit( 0 )
 MonitoringDeviceCriticalLevel( 0 )
 MonitoringDeviceResetLevel( 0 )
 MonitoringDeviceAppliesFullBrake( 1 )
 MonitoringDeviceAppliesEmergencyBrake( 0 )
 MonitoringDeviceAppliesCutsPower( 0 )
 MonitoringDeviceAppliesShutsDownEngine( 0 )
 )
 
 OverspeedMonitor(
 MonitoringDeviceMonitorTimeLimit( 0 )
 MonitoringDeviceAlarmTimeLimit( 0 )
 MonitoringDevicePenaltyTimeLimit( 0 )
 MonitoringDeviceCriticalLevel( 130 )
 MonitoringDeviceResetLevel( 0.1 )
 MonitoringDeviceAppliesFullBrake( 1 )
 MonitoringDeviceAppliesEmergencyBrake( 1 )
 MonitoringDeviceAppliesCutsPower( 1 )
 MonitoringDeviceAppliesShutsDownEngine( 0 )
 MonitoringDeviceAlarmTimeBeforeOverSpeed( 5 )
 MonitoringDeviceDoesSuppressionReset( 0 )
 MonitoringDeviceTriggerOnOverspeed( 135 )
 MonitoringDeviceResetOnZeroSpeed( 1 )
 MonitoringDeviceResetOnResetButton( 0 )
 )
 
 EngineControllers (
 Throttle ( 0 1 0.125 0 
 NumNotches ( 9
 Notch ( 0 0 Dummy )
 Notch ( 0.125 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.375 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.625 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 0.975 0 Dummy )
 Notch ( 1 0 Dummy )
 )
 )
 Brake_Engine ( 0 1 0.0125 0 
 NumNotches ( 1
 Notch ( 0 1 Dummy ) 
 )
 )
 Brake_Train ( 0 1 0.0125 0.75 
 NumNotches ( 5
 Notch ( 0 0 TrainBrakesControllerReleaseStart )
 Notch ( 0.3 1 TrainBrakesControllerGraduatedSelfLapLimitedStart )
 Notch ( 0.95 0 TrainBrakesControllerSuppressionStart )
 Notch ( 0.9 0 TrainBrakesControllerContinuousServiceStart )
 Notch ( 0.95 0 TrainBrakesControllerEmergencyStart )
 )
 )
 DirControl ( -1 0 1 1 )
 BellToggle( 0 1 0 )
 AWS ( 0 1 0 )
 Sanding ( 0 1 0 )
 Horn ( 0 1 0 )
 Wipers ( 0 1 0 )
 EmergencyStopToggle( 0 1 0 )
 Vigilance ( 0 1 0 )
 Headlights ( 0 0.25 1 0 )
 BailOffButton( 0 1 0 )
 )

 
 EngineVariables ( 1030 )
 
 Name ( "#MT Class 254006 [BR Blue Grey]" )
 Description (
" Making Tracks Stock Pack \n"+
" Inter-City 125 HST \n"+
"----------------------------\n"+
" Holder of the World \n"+
" Speed Record for a diesel \n"+
" loco at 147 mph \n"+
"----------------------------\n\n"+
"TOPS No's: 43002 - 43198\n"+
"Builders: BREL, Crewe\n"+
"Introduced: 1976-1982\n"+
"Engine: Paxman 12RP200L\n"+
" Valenta\n"+
"Engine BHP: \n"+
" 2,250hp (1,680 kW)\n"+
" @ 1,500 rpm\n"+
"Transmission: Electric\n"+
"Main Alternator: \n"+
" Brush BA1001A\n"+
"
Auxiliary generator: \n"+
" Brush TG69.28/TG69.20\n"+
"Traction motors: \n"+
" Four Brush TMH68-46\n"+
" (43124-43152) GEC G417AZ\n\n"+
"Maximum tractive effort: \n"+
" 17,980 lbf\n"+
"Continuous tractive effort: \n"+
" 10,340 lbf\n"+
"Power at Rail: 1,770hp\n"+
" (1,320kW)\n"+
"
Maximum Speed: 125 mph\n"+
"Weight: 70 t\n"+
"Route availability: 6\n"+
"Brake force: 35 t\n"+
"Coupling code: within type\n"+
"ETH index: non standard\n"+
" three phase 415V system\n"+
"Driving wheel diameter: \n"+
" 3ft 4in\n"+
"Length: 58ft 5in\n"+
"\n"+
"© MakingTracks RSS Ltd, 2008\n"+
" makingtracks-online.co.uk "
 )

 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key to move the Reverser to Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
 "4. Press the D key to move the throttle from Idle to Notch 1.\n"+ 
 "5. Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the throttle to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+ 
 "To apply the dynamic brakes\n"+
 "1. Press the A key to move the throttle to the Idle position.\n"+
 "2. Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position. After allowing a few seconds for braking circuit setup, press the . [PERIOD] key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
 "To release the dynamic brakes\n"+
 "1. Press the D key to move the throttle towards Idle.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
 "To bail off the train brakes on the locomotive\n"+
 "1. Press the / (FORWARD SLASH) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
 "To apply the locomotive brake\n"+
 "1. Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
 "To release the locomotive brake\n"+
 "1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
 "To activate emergency braking\n"+
 "1. Press the A key to reduce the throttle to Idle.\n"+
 "2. Press the BACKSPACE key to activate emergency braking.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key to move the Reverser to the Reverse position.\n"+
 "4. Release the brakes.\n"+
 "5. Slowly advance the throttle lever (D key).\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window."
 ) 

)
